prod-deploy/results/prod-01-2d-fullretest-20260717/fio/groupC/layout.txt
storage_test: (g=0): rw=write, bs=(R) 4096KiB-4096KiB, (W) 4096KiB-4096KiB, (T) 4096KiB-4096KiB, ioengine=libaio, iodepth=128
...
fio-3.28
Starting 128 processes
storage_test: Laying out IO file (1 file / 1024MiB)
storage_test: Laying out IO file (1 file / 1024MiB)
storage_test: Laying out IO file (1 file / 1024MiB)
[...]

storage_test: (groupid=0, jobs=128): err= 0: pid=1529451: Sat Jul 18 12:23:23 2026
  write: IOPS=28, BW=114MiB/s (119MB/s)(128GiB/1153612msec); 0 zone resets
    slat (msec): min=14, max=11398, avg=4413.57, stdev=1975.75
    clat (usec): min=3, max=648715k, avg=419761408.71, stdev=192187999.63
     lat (msec): min=334, max=651277, avg=424174.98, stdev=192337.54
    clat percentiles (msec):
     |  1.00th=[ 3306],  5.00th=[17113], 10.00th=[17113], 20.00th=[17113],
     | 30.00th=[17113], 40.00th=[17113], 50.00th=[17113], 60.00th=[17113],
     | 70.00th=[17113], 80.00th=[17113], 90.00th=[17113], 95.00th=[17113],
     | 99.00th=[17113], 99.50th=[17113], 99.90th=[17113], 99.95th=[17113],
     | 99.99th=[17113]
   bw (  KiB/s): min=524243, max=795036, per=100.00%, avg=527386.62, stdev=317.31, samples=16267
   iops        : min=  240, max=  270, avg=256.00, stdev= 0.05, samples=16371
  lat (usec)   : 4=0.01%, 10=0.36%, 20=0.03%
  lat (msec)   : 500=0.05%, 750=0.06%, 1000=0.05%, 2000=0.22%, >=2000=99.24%
  cpu          : usr=0.01%, sys=0.01%, ctx=1049471, majf=2, minf=2035
  IO depths    : 1=0.4%, 2=0.8%, 4=1.6%, 8=3.1%, 16=6.2%, 32=12.5%, >=64=75.4%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=99.2%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.8%
     issued rwts: total=0,32768,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=128

Run status group 0 (all jobs):
  WRITE: bw=114MiB/s (119MB/s), 114MiB/s-114MiB/s (119MB/s-119MB/s), io=128GiB (137GB), run=1153612-1153612msec